String[] knowledge  = {"鱷魚通常是直立行走的！",
                       "绵羊能記住你们所有人的臉！",
                       "Nokia原本是荷蘭一種水獺的名字。",
                       "在武則天時代，世界上同時出現了三個女皇帝！",
                       "斑馬其實是黑底白毛",
                       "畢卡索全名:勃羅·迪亞哥·荷西·法蘭西斯科·德·保拉·胡安·尼波穆塞諾·\n瑪麗亞·德·洛斯雷梅迪奧斯·西普里亞諾·德拉桑蒂西馬·特立尼達·魯伊斯-畢卡索",
                       "巴西監獄雇用鵝當守衛，讓警犬瞬間失業",
                       "中國古代的肥皂是用豬胰臟製成",
                       "唱歌減肥法，能燃燒2400大卡，還可增強免疫功能",
                       "毛毛蟲是筋肉王，多達4000塊肌肉",
                       "羅馬兩千多年前就發明了自動販賣機在賣聖水",
                       "開燈睡覺會變憂鬱、也更容易變胖",
                       "睡眠中身體抽動一下，是神經大腦測試你死了沒",
                       "以前古墓長明油燈，都是抹香鯨的腦油",
                       "馬蹄是牠們的中指",
                       "你愛吃的食物會影響你的膚色",
                       "禿鷲會禿頭其實是為了預防生病保持健康",
                       "喝酒會讓你想吃鹹食或拉麵(鹽分+碳水化合物+水)",
                       "罵髒話可以降低壓力，減輕疼痛",
                       "沒有鬧鐘的年代，舊世紀的歐洲，有一群拿著長竿的人，稱為敲門人會挨家挨戶叫你起床",
                       "打火機其實比火柴早問世(打火機16世紀，火柴18世紀末)",
                       "工作沒精神就來娃娃菜，效果比咖啡好(鉀含量高)",
                       "以前歐洲人用乳酪來清潔傷口",
                       "嚼口香糖可以幫助剖腹產及手術等快速復原",
                       "兔子其實很討厭吃紅蘿蔔(紅蘿蔔偏冷，兔子腸胃不好吃了會拉肚子)",
                       "溫度會影響烏龜蛋生男生女",
                       "水棲類烏龜是用屁股呼吸",
                       "陸地最大哺乳類動物大象，平均每天只睡２小時",
                       "行人穿越道的斑馬線，前身是跳石",
                       "蒙古烤肉、左宗棠雞其實是台灣人發明的",
                       "古代麵條稱為湯餅，直到宋代才出現細麵條",
                       "冰糖葫蘆源自於南宋，最早是用來治病的",
                       "土耳其人洗臉要繳稅",
                       "一般情況下，人在睡眠時嗅覺幾乎沒有任何反應，聽覺最敏銳、觸覺次之、再次是視覺",
                       "白掌長臂猿經常骨折",
                       "大白鯊24小時都需要游動，停下就會死，包括睡覺",
                       "防彈背心是一位披薩店老闆被搶劫太多次而想到的",
                       "公皇帝企鵝為了孵蛋，需要60天不吃不喝等老婆回家",
                       "蜉蝣是最短命的，成蟲後會在幾小時~幾天內死去",
                       "鼴鼠只要三小時沒有找到食物，就會立即餓死",
                       "儒艮終身無法睡好覺，每10分鐘就得醒來呼吸",
                       "豬是世界上第五聰明的動物，比狗更聰明",
                       "古人把一種叫做「雌黃」的礦物粉塗在錯別字上，類似現在的立可白，「信口雌黃」就是這樣來的",
                       "比基尼的命名由來跟核試爆地有關",
                       "早餐玉米片具有磁性，可以被磁鐵吸著",
                       "先天性盲人在夢裡是沒有影像的",
                       "英國女王伊莉莎白二世終身沒有護照，且有兩個生日",
                       "冰淇淋有一半都是空氣",
                       "站著不動比跑步運動還要累是因為跑步時兩腳交替休息且手臂擺動會分擔10%能量",
                       "巨石像摩艾在土裡是有完整穿褲子的下半身的"
 };
 int[] used = new int[50];
 
int pd = 1;
int call =1;
int num = int(random(0, 50));

void setup(){
  size(1600,800);
  background(#B8B8DC);
  imageMode(CENTER);
  PFont f;
  f = createFont("標楷體",100); 
  textFont(f,20);
  for(int i=0;i<50;i++){
     used[i] = 0;
   }
}

void draw()
{
  background(000000); 
  if(call == 0){
   call(160,160,num);
 }
   
}

void call(int x,int y,int num){
   fill(#A6FFA6);
   rect(x-100,y-200,1200 ,300);
   fill(#BE77FF);
   text(knowledge[num],x,y);
}

void mousePressed(){
  int x= 200,y = 200;
  pd *= -1;
  if (pd == -1){
    while(used[num] != 0){
      num = int(random(0, 50));
    }
    used[num] = 1;
    call = 0;
  }
  else{
    call = 1;
  }
}
